app/controllers/pages_controller.rb

SELECT "weapons".* FROM "weapons"
---
  def page4
    @weapons = Weapon.all

SELECT "weapons".* FROM "weapons"
---
  def page44
    @weapons = Weapon.all