app/controllers/weapons_controller.rb

SELECT "weapons".* FROM "weapons"
---
  def index
  		@weapons = Weapon.all

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@weapon = Weapon.find(params[:id])

INSERT INTO "weapons" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sword"], ["value", 5], ["created_at", 2017-03-09 07:21:39 UTC], ["updated_at", 2017-03-09 07:21:39 UTC]]
---
  def create
		@weapon = Weapon.new
		@weapon.name = params[:weapon][:name]
		@weapon.value = params[:weapon][:value]

		@weapon.save

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@weapon = Weapon.find(params[:id])

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "weapons" SET "name" = ?, "value" = ?, "updated_at" = ? WHERE "weapons"."id" = ?  [["name", "Sword"], ["value", 5], ["updated_at", 2017-03-06 11:14:42 UTC], ["id", 1]]
---
	def update
		@weapon = Weapon.find(params[:id])

		@weapon.update({:name => params[:weapon][:name], :value => params[:weapon][:value]})

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "weapons" WHERE "weapons"."id" = ?  [["id", 1]]
---
	def delete
		@weapon = Weapon.find(params[:id])
		@weapon.destroy